---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.#ctor
source: html/79b99ce2-1540-5da8-3f21-2fbb96eb6689.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.#ctor Method

Initializes a new instance of the WireConduitTypeSet class

## Syntax (C#)
```csharp
public WireConduitTypeSet()
```